#+TITLE: Chapter 2 - Building Abstractions with Data

*** Exercise 2.21
Here are two different definitions of square-list. Complete both of them by filling in the missing expressions:

#+begin_src scheme
(define (square x) (* x x))

(define (square-list items)
  (if (null? items)
      '()
      (cons (square (car items)) (square-list (cdr items)))))

(eq? (square-list (list 1 2 3 4)) '(1 4 9 16))
#+end_src

#+begin_src scheme
(define (square x) (* x x))

(define (square-list items)
  (map square items))

(eq? (square-list (list 1 2 3 4)) '(1 4 9 16))
#+end_src

#+RESULTS:
: #f
